# **Automatic Data Analysis**

In [8]:
import pandas as pd
import seaborn as sns
import ydata_profiling as yp
import skimpy as sk

In [7]:
#import data from seaborn
df = sns.load_dataset('titanic')
df.info()
# Drop the first 500 rows from the 'titanic' DataFrame
df = df.iloc[500:]

# Print the updated DataFrame
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
500,0,3,male,17.0,0,0,8.6625,S,Third,man,True,NaN,Southampton,no,True
501,0,3,female,21.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True
502,0,3,female,NaN,0,0,7.6292,Q,Third,woman,False,NaN,Queenstown,no,True
503,0,3,female,37.0,0,0,9.5875,S,Third,woman,False,NaN,Southampton,no,True
504,1,1,female,16.0,0,0,86.5000,S,First,woman,False,B,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
profile = yp.ProfileReport(df)
profile.to_file(output_file='ydata_titanic.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Summarize dataset: 100%|██████████| 41/41 [00:42<00:00,  1.04s/it, Completed]
Generate report structure: 100%|██████████| 1/1 [00:09<00:00,  9.72s/it]
Render HTML: 100%|██████████| 1/1 [00:04<00:00,  4.51s/it]
Export report to file: 100%|██████████| 1/1 [00:00<00:00, 11.54it/s]

In [11]:
df = sns.load_dataset('titanic')
sk.annotations(df)

TypeError: '_Feature' object is not callable